In [51]:
import pandas as pd

weather_file = {
    "day" : ['0/2/2004','1/4/2005','12/8/2045','16/9/2044','10/2/2014','11/2/2006'],
     "temperature" : [32,35,28,24,32,31],
    "windspeed" : [6,7,2,7,8,9],
    "events" : ['Rain','Sunny','Snow','Rain','Sunny','Snow']
}
df = pd.DataFrame(weather_file)
df

         day  temperature  windspeed events
0   0/2/2004           32          6   Rain
1   1/4/2005           35          7  Sunny
2  12/8/2045           28          2   Snow
3  16/9/2044           24          7   Rain
4  10/2/2014           32          8  Sunny
5  11/2/2006           31          9   Snow

In [52]:
rows, columns =df.shape
rows, columns

(6, 4)

In [53]:
rows

6

In [54]:
columns

4

In [55]:
df.head(4)#Prints initial data if you have big amount of excell sheets

         day  temperature  windspeed events
0   0/2/2004           32          6   Rain
1   1/4/2005           35          7  Sunny
2  12/8/2045           28          2   Snow
3  16/9/2044           24          7   Rain

##

In [56]:
df.tail(2)

         day  temperature  windspeed events
4  10/2/2014           32          8  Sunny
5  11/2/2006           31          9   Snow

In [57]:
#Slicing with data
df[1:3]# 0 to 2 data print

         day  temperature  windspeed events
1   1/4/2005           35          7  Sunny
2  12/8/2045           28          2   Snow

In [58]:
type(df['events'])#It will print datatype of events

pandas.core.series.Series

In [59]:
#Only Printing Particualar Columns you need and also with there relations
df[['events','day']]

  events        day
0   Rain   0/2/2004
1  Sunny   1/4/2005
2   Snow  12/8/2045
3   Rain  16/9/2044
4  Sunny  10/2/2014
5   Snow  11/2/2006

In [60]:
df[['day','temperature']]#Printing Day and There temperature with single line of code

         day  temperature
0   0/2/2004           32
1   1/4/2005           35
2  12/8/2045           28
3  16/9/2044           24
4  10/2/2014           32
5  11/2/2006           31

In [61]:
#Printing Maximum and Minimum Temperature in whole database
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [62]:
df['temperature'].max()

35

In [63]:
df['temperature'].min()

24

In [64]:
df.describe()#Shows Statastical Numbers

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   6.500000
std       3.829708   2.428992
min      24.000000   2.000000
25%      28.750000   6.250000
50%      31.500000   7.000000
75%      32.000000   7.750000
max      35.000000   9.000000

In [66]:
#Conditions Applying for accurate data

In [67]:
df[df.temperature>=32] #Prints when the temperature goes greater than 32

         day  temperature  windspeed events
0   0/2/2004           32          6   Rain
1   1/4/2005           35          7  Sunny
4  10/2/2014           32          8  Sunny

In [68]:
df[df.temperature == df.temperature.max()]#Print all details when the Temperature was at Max

        day  temperature  windspeed events
1  1/4/2005           35          7  Sunny

In [70]:
df[df.events=='Rain']#Print all details when rain occured

         day  temperature  windspeed events
0   0/2/2004           32          6   Rain
3  16/9/2044           24          7   Rain

In [73]:
df['windspeed'].max()

9

In [80]:
df[df.windspeed>=8]

         day  temperature  windspeed events
4  10/2/2014           32          8  Sunny
5  11/2/2006           31          9   Snow